Samples/RecreditPointsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:type="http://www.ibsplc.com/iloyal/redemption/RecreditPoints/v2.7/type/">
    <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"> 
         <wsu:Timestamp wsu:Id="Timestamp-20046406" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
            <wsu:Expires>2020-01-11T10:33:52.303Z</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken wsu:Id="UsernameToken-20914066" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsse:Username>mtn</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">JC9UDunh4V5pRSEofoUgTur9u5g=</wsse:Password>
            <wsse:Nonce>5lXRolFB0oWSOjRgioe4DA==</wsse:Nonce>
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <type:RecreditPointsRequest>
         <certificate>
            <companyCode>SA</companyCode>
            <programCode>VOYAG</programCode>
            <!--Optional:-->
            <certificateNumber>1000109807</certificateNumber>
            <!--Optional:-->
            <remarks>Activity Cancelled</remarks>
            <!--Optional:-->
            <reasonCode></reasonCode>
            <!--Optional:-->
            <certificateActivityDescription></certificateActivityDescription>
            <!--Optional:-->
            <closedDate></closedDate>
            <!--Optional:-->
            <carrierCode></carrierCode>
            <partnerCode>MTS</partnerCode>
            <rewardCode>MTSR1</rewardCode>
            <rewardGroup>L</rewardGroup>
            <!--Optional:-->
            <rewardDiscount>0</rewardDiscount>
            <!--Optional:-->
            <campaignActivityRefenceNumber></campaignActivityRefenceNumber>
            <!--Optional:-->
            <rewardDescription></rewardDescription>
            <membershipNumber>32757624</membershipNumber>
            <!--Optional:-->
            <origin></origin>
            <!--Optional:-->
            <destination></destination>
            <!--Optional:-->
            <bookingChannel></bookingChannel>
            <title>MR</title>
            <givenName>MARK</givenName>
            <familyName>PENWILL</familyName>
            <!--Optional:-->
            <rewardPoints>0</rewardPoints>
            <!--Optional:-->
            <minimumPoints>0</minimumPoints>
            <!--Optional:-->
            <maximumPoints>0</maximumPoints>
            <!--Optional:-->
            <actualCostofRedemption>0</actualCostofRedemption>
            <!--Optional:-->
            <cabinClass></cabinClass>
            <!--Optional:-->
            <originalBookingClass></originalBookingClass>
            <!--Optional:-->
            <boardeBookingClass></boardeBookingClass>
            <!--Optional:-->
            <excessWeight>0</excessWeight>
            <!--Optional:-->
            <flightNumber>0</flightNumber>
            <!--Optional:-->
            <issueDate></issueDate>
            <!--Optional:-->
            <redemptionDate></redemptionDate>
            <!--Optional:-->
            <pnr></pnr>
            <!--Optional:-->
            <ticketNumber></ticketNumber>
            <!--Optional:-->
            <departureDate></departureDate>
            <!--Optional:-->
            <arrivalDate></arrivalDate>
            <!--Optional:-->
            <fareClassGroup></fareClassGroup>
            <!--Optional:-->
            <ssrCode></ssrCode>
            <!--Optional:-->
            <flightDate></flightDate>
            <points>5000</points>
            <!--Optional:-->
            <plannedDate></plannedDate>
            <!--Optional:-->
            <ticketReissueType></ticketReissueType>
            <!--Optional:-->
            <payNow></payNow>
            <!--Zero or more repetitions:-->
            <paymentDetail>
               <!--Optional:-->
               <pointsCollected>5000</pointsCollected>
               <!--Optional:-->
               <amountCollected>0</amountCollected>
               <paymentType></paymentType>
               <currencyCode></currencyCode>
               <paymentSource></paymentSource>
               <quoteReferenceNumber></quoteReferenceNumber>
               <!--Optional:-->
               <paymentGateWayRefNumber></paymentGateWayRefNumber>
               <!--Optional:-->
               <bankRefNumber></bankRefNumber>
               <!--Optional:-->
               <cardType></cardType>
               <!--Optional:-->
               <cardHolderName></cardHolderName>
            </paymentDetail>
            <!--Zero or more repetitions:-->
            <dynamicAttribute>
               <attributeCode></attributeCode>
               <attributeValue></attributeValue>
            </dynamicAttribute>
            <!--You have a CHOICE of the next 1 items at this level-->
            <flightCertificate>
               <!--Zero or more repetitions:-->
               <flightBookingDetails>
                  <bookingNumber></bookingNumber>
                  <pnr></pnr>
                  <ticketNumber></ticketNumber>
                  <passengerName></passengerName>
                  <!--Zero or more repetitions:-->
                  <flightSegments>
                     <carrierCode></carrierCode>
                     <flightNumber></flightNumber>
                     <ticketNumber></ticketNumber>
                     <departureDate></departureDate>
                     <arrivalDate></arrivalDate>
                     <origin></origin>
                     <destination></destination>
                     <bookingClass></bookingClass>
                     <upgradedBookingClass></upgradedBookingClass>
                     <airlineIdentifier></airlineIdentifier>
                  </flightSegments>
               </flightBookingDetails>
            </flightCertificate>
          </certificate>
         <txnHeader>
            <transactionID>55D6308230786FB3D994D3DDBD3AE5AA</transactionID>
            <userName>mtn</userName>
            <!--Optional:-->
            <transactionToken></transactionToken>
            <timeStamp>2020-01-11T10:33:52.303Z</timeStamp>
         </txnHeader>
      </type:RecreditPointsRequest>
   </soapenv:Body>
</soapenv:Envelope>